yasminEzF/Arm_drivers/INC/LIB/STM32F401CC_interrupts.h
#ifndef STM32F401CC_INTERRUPTS_H_
#define STM32F401CC_INTERRUPTS_H_

#define IRQ_WINDOW_WATCHDOG_TIMER		0
#define	IRQ_EXTERNAL_LINE16			    1
#define	IRQ_EXTERNAL_LINE21			    2
#define	IRQ_EXTERNAL_LINE22			    3
#define	IRQ_FLASH			            4
#define	IRQ_RCC				            5
#define IRQ_EXT0_INTERRRUPT			    6
#define IRQ_EXT1_INTERRRUPT			    7
#define IRQ_EXT2_INTERRRUPT			    8
#define IRQ_EXT3_INTERRRUPT			    9
#define IRQ_EXT4_INTERRRUPT			    10
#define IRQ_DMA1_STREAM0				11
#define IRQ_DMA1_STREAM1				12
#define IRQ_DMA1_STREAM2				13
#define IRQ_DMA1_STREAM3				14
#define IRQ_DMA1_STREAM4				15
#define IRQ_DMA1_STREAM5				16
#define IRQ_DMA1_STREAM6                17
#define IRQ_ADC                         18
#define IRQ_EXT9                        23
#define IRQ_TIM1_BRK                    24
#define IRQ_TIM1_UP                     25
#define IRQ_TIMI1_TRG                   26
#define IRQ_TIMI1_CC                    27
#define IRQ_TIMI2                       28
#define IRQ_TIMI3                       29
#define IRQ_TIMI4                       30
#define IRQ_I2C1_EV                     31
#define IRQ_I2C1_ER                     32
#define IRQ_I2C2_EV                     33
#define IRQ_I2C2_ER                     34
#define IRQ_SPI1                        35
#define IRQ_SPI2                        36
#define IRQ_USART1                      37
#define IRQ_USART2                      38
#define IRQ_EXTI15                      40
#define IRQ_EXTI17                      41
#define IRQ_EXTI18                      42
#define IRQ_DMA1                        47
#define IRQ_SDIO                        49
#define IRQ_TIM5                        50
#define IRQ_SPI3                        51
#define IRQ_DMA2_STREAM0                56
#define IRQ_DMA2_STREAM1                57
#define IRQ_DMA2_STREAM2                58
#define IRQ_DMA2_STREAM3                59
#define IRQ_DMA2_STREAM4                60
#define IRQ_OTG_FS                      67
#define IRQ_DMA2_STREAM5                68
#define IRQ_DMA2_STREAM6                69
#define IRQ_DMA2_STREAM7                70
#define IRQ_USART6                      71
#define IRQ_I2C3_EV                     72
#define IRQ_I2C3_ER                     73
#define IRQ_FPU                         81
#define IRQ_SPI4                        84


#endif /* STM32F401CC_INTERRUPTS_H_ */
